OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
#include "stdio.h"
#include "stdlib.h"
#include "nuc980.h"
#include "sys.h"
#include "etimer.h"
#include "config.h"
#include "usbd.h"
#include "fmi.h"
#include "sdglue.h"
#include "sd.h"
#include "qspi.h"
#include "filesystem.h"
#include "spinandflash.h"

#define BATCH_BRUN

#define TRANSFER_LEN 4096

#define SPI_BLOCK_SIZE (64*1024)
#define SPI_FLASH_SIZE (16*1024*1024)  //4Byte Address Mode

#define IBR_HEADER_LEN 32

UINT32 g_uIsUserConfig; //nand

UCHAR NandBlockSize=0;
INT32 eMMCBlockSize=0;

unsigned char *pImageList;
unsigned char imageList[512];

FW_NOR_IMAGE_T spiImage;
FW_NOR_IMAGE_T *pSpiImage;

SPINAND_INFO_T SNInfo, *pSN;

//-------------------------
extern int usiInit(void);
extern int usiEraseAll(void);
extern int usiWrite(UINT32 addr, UINT32 len, UINT16 *buf);
extern int usiRead(UINT32 addr, UINT32 len, UINT8 *buf);
extern int usiEraseSector(UINT32 addr, UINT32 secCount);

extern int ChangeSpiImageType(UINT32 imageNo, UINT32 imageType);
extern int DelSpiImage(UINT32 imageNo);
extern int DelSpiSector(UINT32 start, UINT32 len);

extern volatile unsigned char Enable4ByteFlag;
extern INFO_T info;

//-------------------------
#define PACK_Mode(val)      (((val)&0xF   )>> 0)
#define PACK_Option(val)    (((val)&0xF0  )>> 4)
#define PACK_Enable(val)    (((val)&0xF000)>>12)

#define WRITER_MODE   0
#define MODIFY_MODE   1
#define ERASE_MODE    2
#define VERIFY_MODE   3
#define READ_MODE     4
#define PACK_MODE     5
#define FORMAT_MODE   6
#define PACK_VERIFY_MODE   7

#define DATA      0
#define ENV       1
#define UBOOT     2
#define PACK      3
#define IMAGE     4
#define DATA_OOB  5
#define YAFFS2  41
#define UBIFS   42
#define PMTP    15

#define WDT_RSTCNT    outpw(REG_WDT_RSTCNT, 0x5aa5)

void usleep(int count)
{
    int volatile i=0;

    for(i=0; i<count; i++);
}

UINT32 fmiGetSPIImageInfo(unsigned int *image)
{
    UINT32 volatile bmark, emark;
    int volatile i, imageCount=0;
    unsigned char volatile *pbuf;
    unsigned int volatile *ptr;
    UCHAR _fmi_ucBuffer[1024];
    pbuf = (UINT8 *)((UINT32)_fmi_ucBuffer | 0x80000000);
    ptr = (unsigned int *)((UINT32)_fmi_ucBuffer | 0x80000000);
    usiRead(((SPI_HEAD_ADDR-1)*64+63)*1024, 1024, (UINT8 *)pbuf);  /* offset, len, address */
    bmark = *(ptr+0);
    emark = *(ptr+3);

    if ((bmark == 0xAA554257) && (emark == 0x63594257)) {
        imageCount = *(ptr+1);

        /* pointer to image information */
        ptr = ptr+4;
        for (i=0; i<imageCount; i++) {
            /* fill into the image list buffer */
            *image = 0;     // action flag, dummy
            *(image+1) = 0; // file len, dummy
            *(image+2) = *(ptr) & 0xffff;
            memcpy((char *)(image+3), (char *)(ptr+4), 16);
            *(image+7) = (*(ptr) >> 16) & 0xffff;
            *(image+8) = (*(ptr+1)) + (*(ptr+3));
            *(image+9) = *(ptr+1);
            *(image+10) = *(ptr+3);

            //MSG_DEBUG("\nNo[%d], Flag[%d], name[%s]\n\n",
            //  *(image+2), *(image+7), (char *)(image+3));
            /* pointer to next image */
            image += 11;
            ptr = ptr+8;
        }
    } else
        imageCount = 0;

    return imageCount;
}

void addMagicHeader(unsigned int address, unsigned int length)
{
    int volatile i;
    unsigned int *ptr;
    unsigned char *magic;
    unsigned char MagicWord[4] = {0x20, 'T', 'V', 'N'}; /* 1st word - Magic word */
    ptr =((unsigned int*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    magic =((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));

    for (i=0; i<sizeof(MagicWord); i++)
        *magic++ = MagicWord[i];

    *(ptr+1) = address;          /* 2nd word - Target Address */
    *(ptr+2) = length;           /* 3rd word - Total length   */
    *(ptr+3) = 0xFFFFFFFF;
}

void addNUC980MagicHeader(unsigned char u8IsSPINOR)
{
    int volatile i;
    unsigned int volatile *u32ptr;
    unsigned char volatile *u8header;

    u32ptr =((unsigned int*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    u8header =((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));

    if(u8IsSPINOR == 1) { // SPI NOR
        // IBR_Header for SPI NOR Flash
        u8header[16] = 0x00;
        u8header[17] = 0x08;
        u8header[18] = 0x40;
        u8header[19] = 0x00;
        u8header[20] = info.SPI_QuadReadCmd;
        u8header[21] = info.SPI_ReadStatusCmd; // Read Status Register
        u8header[22] = info.SPI_WriteStatusCmd; // Write Status Register
        u8header[23] = info.SPI_StatusValue; // QE(Status Register[6]) Bit 6
        u8header[24] = info.SPI_dummybyte;
        u8header[25] = 0xff;
        u8header[26] = 0xff;
        u8header[27] = 0xff;
    } else {
        // IBR_Header for SPI NAND Flash
        u8header[16] = 0x00;//info.SPINand_PageSize;
        u8header[17] = 0x08;//info.SPINand_PageSize;
        u8header[18] = 0x40;//info.SPINand_SpareArea;
        u8header[19] = 0x00;//info.SPINand_SpareArea;
        u8header[20] = info.SPINand_QuadReadCmd;
        u8header[21] = info.SPINand_ReadStatusCmd;
        u8header[22] = info.SPINand_WriteStatusCmd;
        u8header[23] = info.SPINand_StatusValue;
        u8header[24] = info.SPINand_dummybyte;
        u8header[25] = 0xff;//0x2
        u8header[26]= 0xff;
        u8header[27]= 0xff;
    }
    *(u32ptr+7) = 0xFFFFFFFF;
}

int Burn_SPI(UINT32 len,UINT32 imageoffset)
{
    int volatile tmplen=0;
    int i, offset=0, blockCount, spiSourceAddr;

    MSG_DEBUG("Burn_SPI: len=%d     imageoffset= %d\n", len, imageoffset);
    /* set up interface */
    if (usiInit() < 0) {
        SendAck(0xFFFFFFFF);
        return Fail;
    }

    spiSourceAddr = (DOWNLOAD_BASE | NON_CACHE);
    blockCount = len / SPI_BLOCK_SIZE;
    offset = imageoffset;
    MSG_DEBUG("Burn_SPI: offset=0x%x  len=%d   blockCount= %d  spiSourceAddr = 0x%x\n", offset, len, blockCount, spiSourceAddr);

    for (i=0; i<blockCount; i++) {
        MSG_DEBUG("Burn_SPI  offset=0x%x(%d)\n", offset, offset);
        Enable4ByteFlag = 0;
        // 4Byte Address Mode (>16MByte)
        if((offset + SPI_BLOCK_SIZE) > SPI_FLASH_SIZE)
            Enable4ByteFlag = 1;
        if(len > SPI_FLASH_SIZE)
            Enable4ByteFlag = 1;

