OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
        if(Enable4ByteFlag)
            MSG_DEBUG("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

        usiEraseSector(offset, 1);
        usiWrite(offset, SPI_BLOCK_SIZE, (UINT16 *)spiSourceAddr);

        spiSourceAddr += SPI_BLOCK_SIZE;
        offset += SPI_BLOCK_SIZE;

        //ack status
        tmplen += SPI_BLOCK_SIZE;
        SendAck((tmplen * 95) / len);
    }
    if ((len % (SPI_BLOCK_SIZE)) != 0) {
        MSG_DEBUG("Burn_SPI  offset=0x%x(%d)\n", offset, offset);
        // 4Byte Address Mode (>16MByte)
        Enable4ByteFlag = 0;
        if((offset + SPI_BLOCK_SIZE) > SPI_FLASH_SIZE)
            Enable4ByteFlag = 1;
        if(offset > SPI_FLASH_SIZE)
            Enable4ByteFlag = 1;

        if(Enable4ByteFlag)
            MSG_DEBUG("Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

        len = len - blockCount*SPI_BLOCK_SIZE;
        usiEraseSector(offset, 1);
        usiWrite(offset, len, (UINT16 *)spiSourceAddr);
    }
    //ack status
    SendAck(100);

    return 0;
}

void UXmodem_SPI(void)
{
    int len,i;
    unsigned char *ptr;
    unsigned char buf[80];
    unsigned char *_ch;
    unsigned int *_ack;
    unsigned int offset=0;
    unsigned int remain, ddrlen;
    PACK_CHILD_HEAD ppack;
    unsigned int ret;

    MSG_DEBUG("download image to SPI flash...\n");
    memset((char *)&spiImage, 0, sizeof(FW_NOR_IMAGE_T));
    pSpiImage = (FW_NOR_IMAGE_T *)&spiImage;
    usiInit();  //Init SPI
    MSG_DEBUG("UXmodem_SPI\n");
    _ch=((unsigned char*)(((unsigned int)buf)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    ptr=_ch;

    while(1) {
        if(Bulk_Out_Transfer_Size>0) {
            usb_recv(ptr,sizeof(FW_NOR_IMAGE_T));
            memcpy(pSpiImage,(unsigned char *)ptr,sizeof(FW_NOR_IMAGE_T));
            break;
        }
    }

    MSG_DEBUG("action flag %d, image %d, len=%d exec=0x%08x type=%d\n",
              pSpiImage->actionFlag, pSpiImage->imageNo,pSpiImage->fileLength,pSpiImage->executeAddr,pSpiImage->imageType);
    usiInit();
    switch(pSpiImage->actionFlag) {
    case WRITER_MODE: { // normal write
        MSG_DEBUG("SPI normal write !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x85;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

        if (pSpiImage->imageType == UBOOT) {    // uboot image
            pSpiImage->imageNo = 0;
            pSpiImage->flashOffset = 0;
            addMagicHeader(pSpiImage->executeAddr, pSpiImage->fileLength);
            addNUC980MagicHeader(1);
            ptr += IBR_HEADER_LEN; // except the 32 bytes magic header
            offset = IBR_HEADER_LEN;
        } else
            offset=0;

        do {
            if(Bulk_Out_Transfer_Size>0) {

                len=Bulk_Out_Transfer_Size;
                usb_recv(ptr,len);  //recv data from PC
                ptr+=len;
                *_ack=len;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while((ptr-_ch)<(pSpiImage->fileLength+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize));
        Burn_SPI(pSpiImage->fileLength+(((FW_NOR_IMAGE_T *)pSpiImage)->initSize)+offset,pSpiImage->flashOffset);
    }
    break;

    case MODIFY_MODE: { // modify
        MSG_DEBUG("SPI modify !!!\n");
        {
            int state;
            state = ChangeSpiImageType(pSpiImage->imageNo, pSpiImage->imageType);
            if (state < 0) {
                //MSG_DEBUG("error!!\n");
                SendAck(0xFFFFFFFF);
            } else {
                //MSG_DEBUG("OK!!\n");
                SendAck(100);
            }
        }
    }
    break;

    case ERASE_MODE: { // erase
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x85;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        MSG_DEBUG("SPI erase !!! imageNo=%d\n",pSpiImage->imageNo);
        MSG_DEBUG("\nstart=%d\n",pSpiImage->flashOffset); //start block
        MSG_DEBUG("length=%d\n",pSpiImage->executeAddr);  //block length
        MSG_DEBUG("type=%d\n",pSpiImage->imageType);      //0: chip erase, 1: erase accord start and length blocks.
        MSG_DEBUG("type=0x%08x\n",pSpiImage->imageNo);

        if (pSpiImage->imageNo != 0xFFFFFFFF)
            DelSpiSector(pSpiImage->flashOffset,pSpiImage->executeAddr);
        else {
            // erase all
            ret = usiEraseAll();
            if(ret == 0) {
                MSG_DEBUG("erase all done \n");
                SendAck(100);
            } else {
                MSG_DEBUG("Error erase all fail \n");
                SendAck(0xffffff);
            }
        }
    }
    break;

    case VERIFY_MODE: { // verify
        MSG_DEBUG("SPI normal verify !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x85;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        MSG_DEBUG("offset=%d,flashOffset=%d,fileLength=%d\n",offset,pSpiImage->flashOffset,pSpiImage->fileLength);
        memset(ptr, 0, pSpiImage->fileLength);
        offset=0;
        do {
            //4Byte Address Mode (>16MByte)
            Enable4ByteFlag = 0;
            if((pSpiImage->flashOffset + offset + TRANSFER_LEN) > SPI_FLASH_SIZE)
                Enable4ByteFlag = 1;

            if(Enable4ByteFlag)
                MSG_DEBUG("VERIFY_MODE  Enable4ByteFlag %d:  offset=0x%08x(%d)\n", Enable4ByteFlag, offset, offset);

            if (pSpiImage->flashOffset == 0)
                usiRead(pSpiImage->flashOffset+IBR_HEADER_LEN+offset+((FW_NOR_IMAGE_T *)pSpiImage)->initSize, TRANSFER_LEN, (UINT8 *)(DOWNLOAD_BASE));
            else
                usiRead(pSpiImage->flashOffset+offset, TRANSFER_LEN, (UINT8 *)(DOWNLOAD_BASE));
            usb_send(ptr,TRANSFER_LEN); //send data to PC

            usb_recv((unsigned char*)_ack,4);   //recv data from PC
            if(*_ack==0)
                break;
            else
                offset+=(*_ack);
        } while(offset<pSpiImage->fileLength);
    }
    break;
    case PACK_VERIFY_MODE: { // verify
        MSG_DEBUG("\n SPI PACK verify !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x85;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        MSG_DEBUG("offset=%d,flashOffset=%d,fileLength=%d\n",offset,pSpiImage->flashOffset,pSpiImage->fileLength);
        memset(ptr, 0, pSpiImage->fileLength);
        offset=0;

        for(i=0; i<pSpiImage->imageNo; i++) {
            while(1) {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD)) {
                    usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                    memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                    usleep(1000);
                    *_ack=0x85;
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }
            pSpiImage->fileLength = ppack.filelen;
            pSpiImage->flashOffset = ppack.startaddr;
            offset = 0;
            MSG_DEBUG("imageNum = %d, offset=0x%x, flashOffset=0x%x, fileLength=0x%x\n",i, offset,pSpiImage->flashOffset,pSpiImage->fileLength);
            // Get DDR parameter length
            if (ppack.imagetype == UBOOT) {   // system image
                usb_recv(ptr,4);
                memcpy(&ddrlen,(unsigned char *)ptr,4);
                MSG_DEBUG("ddrlen = %d\n", ddrlen);
                //usleep(1000);
                *_ack=0x85;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }

