OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
    MSG_DEBUG("run ... %x\n", address);

    SYS_UnlockReg();
    outpw(REG_CLK_HCLKEN, 0x00004527);
    outpw(REG_CLK_PCLKEN0, 0);
    outpw(REG_CLK_PCLKEN1, 0);
    outpw(REG_CLK_DIVCTL3, 0);//Reset SD0 Clock Source and Divider
    outpw(REG_CLK_DIVCTL9, 0);//Reset SD1 Clock Source and Divider
    outpw(REG_WDT_CTL, (inpw(REG_WDT_CTL) & ~(0xf << 8))|(0x6<<8));// Default WDT timeout 2^16 * (12M/512) = 2.79 sec
    MSG_DEBUG("SRAM WDT: 0x08%x/0x08%x/0x08%x\n",inpw(REG_WDT_CTL),inpw(REG_WDT_ALTCTL),inpw(REG_WDT_RSTCNT));
    u32PowerOn = inpw(REG_SYS_PWRON);
    if(((u32PowerOn&0x10) >> 4)) { //PG[15:11] used as JTAG interface
        for(i=(unsigned int)REG_SYS_GPA_MFPL; i<=(unsigned int)REG_SYS_GPG_MFPH; i+=4) {
            if(i == REG_SYS_GPG_MFPH) {
                outpw(i,inpw(REG_SYS_GPG_MFPH)& ~0x00000FFF);
                //printf("inpw(REG_SYS_GPG_MFPH) = 0x%x\n", inpw(REG_SYS_GPG_MFPH));
                continue;
            } else
                outpw(i,0x00);
        }
    } else { //PA[6:2] used as JTAG interface
        for(i=(unsigned int)REG_SYS_GPA_MFPL; i<=(unsigned int)REG_SYS_GPG_MFPH; i+=4) {
            if(i == REG_SYS_GPA_MFPL) {
                outpw(i,inpw(REG_SYS_GPA_MFPL)& ~0xF00000FF);
                //printf("inpw(REG_SYS_GPA_MFPL) = 0x%x\n", inpw(REG_SYS_GPA_MFPL));
                continue;
            } else
                outpw(i,0x00);
        }
    }

    SYS_LockReg();

    if(address<offset)
        memcpy((unsigned char *)address,(unsigned char *)tmpAddr,offset);

    if(dtbEn==1)
        fw_dtbfunc(0,0,dtbAddr,address);
    else
        fw_func(0, ChipID, 0x100);
    return status;
}

void UXmodem_SDRAM(void)
{
    unsigned int fileAddr=0, dtbAddr=0, fileSize=0, exeFlag=0, dtbFlag=0;//actionFlag=0
    int len, debuglen = 0;
    unsigned char *ptr;
    unsigned char buf[80];
    unsigned char *_ch;
    unsigned int *_ack;

    int Otag;
    unsigned int offset=0x40;
    unsigned int tmpAddr=((EXEADDR-0x100000)-offset); // 62M

    MSG_DEBUG("download image to SDRAM...\n");

    _ch=((unsigned char*)(((unsigned int)buf)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    ptr=_ch;

    while(1) {
        if(Bulk_Out_Transfer_Size>0) {
            usb_recv(ptr,16);

            //actionFlag=*((unsigned int*)ptr);
            fileSize=*((unsigned int*)(ptr+4));
            fileAddr=*((unsigned int*)(ptr+8));
            dtbAddr=*((unsigned int*)(ptr+12));
            break;
        }
    }

    /* for debug or delay */
    {
        *_ack=0x80;
        usb_send((unsigned char*)_ack,4);//send ack to PC
    }

    MSG_DEBUG("action flag %d, address 0x%x, len %d, dtbAddr 0x%x\n", actionFlag, fileAddr, fileSize, dtbAddr);
    /* check if the image need execute */
    if (fileAddr & 0x80000000) {
        exeFlag = 1;
        fileAddr = fileAddr & 0x7FFFFFFF;
    }

    if (dtbAddr & 0x80000000) {
        dtbFlag = 1;
        dtbAddr = dtbAddr & 0x7FFFFFFF;
    }

    _ch=((unsigned char*)(((unsigned int)fileAddr | NON_CACHE)));
    if(fileAddr<offset && exeFlag == 1) {
        Otag=1;
        ptr=_ch+offset;
    } else {
        Otag=0;
        ptr=_ch;
    }
    MSG_DEBUG("Otag=%d,  0x%x\n", Otag, ptr);
    do {
        if(Bulk_Out_Transfer_Size>0) {
            len=Bulk_Out_Transfer_Size;
            usb_recv(ptr,len);  //recv data from PC
            if(Otag==1) {
                memcpy((unsigned char *)tmpAddr,ptr,offset);
                memcpy(ptr,ptr+offset,len-offset);
                ptr+=(len-offset);
                Otag=0;
            } else {
                ptr+=len;
            }
            *_ack=len;
            usb_send((unsigned char*)_ack,4);//send ack to PC
            debuglen+=len;
            //printf("ptr-_ch =0x%x, debugcnt = %d, debuglen =%d\n", (ptr-_ch), debugcnt++, debuglen);
        }

    } while((ptr-_ch)<fileSize);

    printf("\nfinish SDRAM download ...\n");

    if (exeFlag == 1) { /* execute image */

#ifdef MSG_DEBUG_EN
        MSG_DEBUG("execute image ...\n");
#else
        ETIMER_Delay(0, 100); /* Waiting for application recevie ack */
#endif

        if(dtbFlag == 1) {
            dtbAddr = dtbAddr & 0x7FFFFFFF;
            Run_SDRAM(fileAddr,offset,tmpAddr,1,dtbAddr);
        }
        Run_SDRAM(fileAddr,offset,tmpAddr,0,0);
    } else
        MSG_DEBUG("only download ...\n");
}

/******************************************************************************
 *
 *  eMMC Functions
 *
 ******************************************************************************/
extern FW_MMC_IMAGE_T mmcImage;
extern FW_MMC_IMAGE_T *pmmcImage;
extern void GetMMCImage(void);

void Burn_MMC_RAW(UINT32 len, UINT32 offset,UINT8 *ptr)
{
    MSG_DEBUG("offset=%d,len=%d\n",offset>>9,len>>9);
    fmiSD_Write(offset>>9, len>>9, (UINT32)ptr);
}

void Read_MMC_RAW(UINT32 len, UINT32 offset,UINT8 *ptr)
{
    MSG_DEBUG("offset=%d,len=%d\n",offset>>9,len>>9);
    fmiSD_Read(offset>>9, len>>9, (UINT32)ptr);
}

int BatchBurn_MMC_BOOT(UINT32 len,UINT32 offset)
{
    int volatile tmplen=0;
    UINT32 TotalBlkCount,blockCount, mmcSourceAddr;
    UINT8 infoBuf[512],*ptr;

    unsigned char *_ch;
    unsigned int *_ack,ack=0;
    unsigned int reclen,remainlen;

    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));

    /* set up interface */
    if (fmiInitSDDevice() < 0) {
        SendAck(0xFFFFFFFF);
        return Fail;
    }

    /* check image 0 / offset 0 and back up */
    //if (pmmcImage->imageType == UBOOT)  // system image, burn nomal image
    //    fmiSD_Read(MMC_INFO_SECTOR,1,(UINT32)pInfo);

    mmcSourceAddr = (DOWNLOAD_BASE | NON_CACHE);
    ptr = (UINT8 *)mmcSourceAddr;
    TotalBlkCount = blockCount = (len+((SD_SECTOR)-1))/(SD_SECTOR);

    while(blockCount>=SD_MUL) {
        ptr=_ch;
        remainlen=(SD_SECTOR*SD_MUL);
        do {
            if(Bulk_Out_Transfer_Size>0) {
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while((ptr-_ch)<(remainlen!=0));

        MSG_DEBUG("offset=0x%08x,ptr_addr=0x%08x,ptr=%d\n",offset,(UINT32)ptr,*(ptr));
        fmiSD_Write(offset,SD_MUL,(UINT32)ptr);
        blockCount-=SD_MUL;
        offset+=SD_MUL;
        /* ack status */
        tmplen += (SD_SECTOR*SD_MUL);
    }
    if(blockCount!=0) {
        ptr=_ch;
        remainlen=len-((SD_SECTOR)*(TotalBlkCount-blockCount));
        do {
            if(Bulk_Out_Transfer_Size>0) {
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen;//|((pagetmp * 95) / total)<<16;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while((ptr-_ch)<(remainlen!=0));
        fmiSD_Write(offset,blockCount,(UINT32)ptr);
    }
    /* restore image 0 and offset 0 */
    if (pmmcImage->imageType == 3) { // system image, burn nomal image
        if((pmmcImage)->macaddr[7]==1)
            memcpy(infoBuf+0x190,(UCHAR *)((pmmcImage)->macaddr),6);  // MAC Address
    }

