OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
    if ((pmmcImage->flashOffset != 2) || (pmmcImage->imageType == 3)) {
        /* set MMC information */
        MSG_DEBUG("SetMMCImageInfo\n");
        SetMMCImageInfo(pmmcImage);
    }
    //ack status
    SendAck(100);

    return 0;
}

int BatchBurn_MMC(UINT32 len,UINT32 offset,UINT32 HeaderFlag)
{
    int volatile tmplen=0, i, blockCount=0;
    UINT32 volatile mmcSourceAddr;
    UINT8 volatile infoBuf[512],*ptr;
    unsigned char *_ch;
    unsigned int *_ack,ack=0;
    unsigned int volatile reclen,remainlen;
    unsigned int volatile headlen;

    if(HeaderFlag==1)
        headlen=IBR_HEADER_LEN;
    else
        headlen=0;

    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));

    /* set up interface */
    if (fmiInitSDDevice() < 0) {
        SendAck(0xFFFFFFFF);
        return Fail;
    }

    /* check image 0 / offset 0 and back up */
    //if (pmmcImage->imageType == UBOOT)  // system image, burn nomal image
    //    fmiSD_Read(MMC_INFO_SECTOR,1,(UINT32)pInfo);

    mmcSourceAddr = (DOWNLOAD_BASE | NON_CACHE);
    ptr = (UINT8 *)mmcSourceAddr;
    tmplen=len;
    MSG_DEBUG("debug eMMC  blockCount=%d   tmplen=%d    _ack = 0x%x\n",blockCount, tmplen, *_ack);
    while(tmplen>TRANSFER_LEN) {
        ptr=_ch+headlen;
        remainlen=(SD_SECTOR*SD_MUL);//4096
        //usleep(1000);
        do {
            MSG_DEBUG("Bulk_Out_Transfer_Size=%d   remainlen =%d\n",Bulk_Out_Transfer_Size, remainlen);
            if(Bulk_Out_Transfer_Size>0) {
                reclen=MIN(TRANSFER_LEN,remainlen);
                //MSG_DEBUG("reclen=0x%08x\n",reclen);
                usb_recv((UINT8 *)ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while(remainlen!=0);
        ptr=_ch;
        MSG_DEBUG("tmplen=0x%08x,ptr_addr=0x%08x,ptr=%d\n",tmplen,(UINT32)ptr,*(ptr));
        fmiSD_Write(offset,SD_MUL,(UINT32)ptr);
        //MSG_DEBUG("eMMC ret=0x%x\n",ret);
        blockCount-=SD_MUL;
        offset+=SD_MUL;
        tmplen -= (SD_SECTOR*SD_MUL);
        memcpy(_ch,_ch+(SD_SECTOR*SD_MUL),headlen);
    }

    if(tmplen!=0) {
        ptr=_ch+headlen;
        remainlen=tmplen;
        do {
            MSG_DEBUG("Last Bulk_Out_Transfer_Size=%d   remainlen =%d\n",Bulk_Out_Transfer_Size, remainlen);
            if(Bulk_Out_Transfer_Size>0) {
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv((UINT8 *)ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while(remainlen!=0);
        ptr=_ch;
        MSG_DEBUG("tmplen=0x%08x,ptr_addr=0x%08x,ptr=%d\n",tmplen,(UINT32)ptr,*(ptr));
        fmiSD_Write(offset,(tmplen+SD_SECTOR-1)/SD_SECTOR,(UINT32)ptr);
    }
    /* restore image 0 and offset 0 */
    if (pmmcImage->imageType == 3) { // system image, burn normal image
        if((pmmcImage)->macaddr[7]==1)
            memcpy((UINT8 *)infoBuf+0x190,(UCHAR *)((pmmcImage)->macaddr),6);  // MAC Address
    }

    if ((pmmcImage->flashOffset != 2) || (pmmcImage->imageType == 3)) {
        /* set MMC information */
        MSG_DEBUG("SetMMCImageInfo\n");
        SetMMCImageInfo(pmmcImage);
    }
    //ack status
    SendAck(100);

    return 0;
}

void UXmodem_MMC()
{
    int volatile len,i, j, ret;
    PMBR pmbr;
    unsigned char *ptr;
    unsigned char buf[80];
    unsigned char *_ch;
    unsigned int *_ack;
    unsigned int volatile blockCount,offset=0;
    PACK_CHILD_HEAD ppack;
    unsigned int ddrlen;

    MSG_DEBUG("Start  download image to eMMC flash...\n");
    /* initial eMMC */
    fmiInitSDDevice();

    memset((char *)&mmcImage, 0, sizeof(FW_MMC_IMAGE_T));
    pmmcImage = (FW_MMC_IMAGE_T *)&mmcImage;
    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    ptr=_ch;
    while(1) {
        if(Bulk_Out_Transfer_Size>0) {
            usb_recv(ptr,sizeof(FW_MMC_IMAGE_T));
            memcpy(pmmcImage,(unsigned char *)ptr,sizeof(FW_MMC_IMAGE_T));
            break;
        }
    }
    MSG_DEBUG("action flag %d, image %d, len=0x%x(%d) exec=0x%08x\n",
              pmmcImage->actionFlag, pmmcImage->imageNo,pmmcImage->fileLength, pmmcImage->fileLength, pmmcImage->executeAddr);

    switch(pmmcImage->actionFlag) {
    case WRITER_MODE: /* normal write */
        MSG_DEBUG("eMMC normal write !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        MSG_DEBUG("Wait for USBD !!!\n");
        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

        if (pmmcImage->imageType == UBOOT) {    // system image

            pmmcImage->imageNo = 0;
            pmmcImage->flashOffset = 0x400;
            addMagicHeader(pmmcImage->executeAddr, pmmcImage->fileLength);
            addNUC980MagicHeader(1);
            ptr += IBR_HEADER_LEN;// except the 32 bytes magic header
#if 0
            pmmcImage->executeAddr = 0x1200000;  /* 18MB */
#endif
        }
        MSG_DEBUG("Bulk_Out_Transfer_Size pmmcImage->fileLength=0x%08x!!!\n",pmmcImage->fileLength);

        MSG_DEBUG("Burn_MMC!!!\n");
        if (pmmcImage->imageType == UBOOT) {
            MSG_DEBUG("BatchBurn_MMC() [0x%x(%d)/0x%x(%d)/1]\n", pmmcImage->fileLength+pmmcImage->initSize+IBR_HEADER_LEN, pmmcImage->fileLength+pmmcImage->initSize+IBR_HEADER_LEN, (pmmcImage->flashOffset/SD_SECTOR), (pmmcImage->flashOffset/SD_SECTOR));
            ret = BatchBurn_MMC(pmmcImage->fileLength+pmmcImage->initSize+IBR_HEADER_LEN,(pmmcImage->flashOffset/SD_SECTOR),1);
            if(ret == 1) {
                printf("Error BatchBurn_MMC Device UBOOT image error !!! \n");
                return;
            }
        } else {
            MSG_DEBUG("BatchBurn_MMC() [0x%x(%d)/0x%x(%d)/0]\n", pmmcImage->fileLength, pmmcImage->fileLength, pmmcImage->flashOffset/SD_SECTOR, pmmcImage->flashOffset/SD_SECTOR);
            ret = BatchBurn_MMC(pmmcImage->fileLength,(pmmcImage->flashOffset/SD_SECTOR),0);
            if(ret == 1) {
                printf("Error BatchBurn_MMC Device others image error !!! \n");
                return;
            }
        }

        break;
    case MODIFY_MODE: /* modify */
        MSG_DEBUG("eMMC modify !!!\n");
        {
            int state;
            state = ChangeMMCImageType(pmmcImage->imageNo, pmmcImage->imageType);
            if (state < 0) {
                //MSG_DEBUG("error!!\n");
                SendAck(0xFFFFFFFF);
            } else {
                //MSG_DEBUG("OK!!\n");
                SendAck(100);
            }
        }
        break;
    case ERASE_MODE: /* erase */
        MSG_DEBUG("eMMC erase !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        //if pmmcImage->imageNo = 0xFFFFFFFF then erase all
        DelMMCImage(pmmcImage->imageNo);
        break;
    case VERIFY_MODE: { // verify
        MSG_DEBUG("MMC normal verify !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        if(pmmcImage->imageType == UBOOT)
            blockCount = (pmmcImage->fileLength+IBR_HEADER_LEN+pmmcImage->initSize+((SD_SECTOR)-1))/(SD_SECTOR);
        else
            blockCount = (pmmcImage->fileLength+((SD_SECTOR)-1))/(SD_SECTOR);

