OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
        len=pmmcImage->fileLength;
        blockCount = (blockCount+SD_MUL-1)/SD_MUL;
        offset = pmmcImage->flashOffset/SD_SECTOR;

        if(pmmcImage->imageType==UBOOT) {
            fmiSD_Read(offset,SD_MUL,(UINT32)ptr);
            offset+=SD_MUL;
            if(blockCount==1) {
                ptr=_ch+(IBR_HEADER_LEN+pmmcImage->initSize);
                usb_send(ptr,TRANSFER_LEN); //send data to PC
                while(Bulk_Out_Transfer_Size==0) {}
                usb_recv((unsigned char*)_ack,4);   //recv data from PC
            } else {
                INT32 volatile mvlen,tranferlen;
                tranferlen=len;
                mvlen=(SD_MUL*SD_SECTOR)-(IBR_HEADER_LEN+pmmcImage->initSize);
                memmove(_ch,_ch+(IBR_HEADER_LEN+pmmcImage->initSize),mvlen);
                //printf("len %d, blockCount=%d\n", len, blockCount);
                for(i=1; i<blockCount; i++) {
                    ptr=_ch+mvlen;
                    fmiSD_Read(offset,SD_MUL,(UINT32)ptr);
                    ptr=_ch;
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);   //recv data from PC
                    tranferlen-=TRANSFER_LEN;
                    memmove(_ch,_ch+(8*SD_SECTOR),mvlen);
                    offset+=SD_MUL;
                    //printf("%d   tranferlen = %d\n", i, tranferlen);
                }
                if(tranferlen>0) {
                    //printf("rnt tranferlen = %d\n", tranferlen);
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    //usb_send(ptr,tranferlen); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);   //recv data from PC
                }
            }
        } else {
            for(i=0; i<blockCount; i++) {
                fmiSD_Read(offset,SD_MUL,(UINT32)ptr);
                usb_send(ptr,TRANSFER_LEN); //send data to PC
                usb_recv((unsigned char*)_ack,4);   //recv data from PC
                offset+=SD_MUL;
            }
        }
    }
    break;
    case PACK_VERIFY_MODE: { // verify
        MSG_DEBUG("eMMC PACK verify !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

        for(j=0; j<pmmcImage->imageNo; j++) {
            MSG_DEBUG("loop %d:  pmmcImage->imageNo = %d,  initSize=0x%08x\n", j, pmmcImage->imageNo, pmmcImage->initSize);
            while(1) {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD)) {
                    usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                    memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                    usleep(1000);
                    *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }

            pmmcImage->imageType = ppack.imagetype;
            pmmcImage->fileLength = ppack.filelen;
            pmmcImage->flashOffset = ppack.startaddr;
            MSG_DEBUG("pmmcImage->fileLength = %d(0x%x)\n", pmmcImage->fileLength, pmmcImage->fileLength);
            MSG_DEBUG("pmmcImage->flashOffset = %d(0x%x)\n", pmmcImage->flashOffset, pmmcImage->flashOffset);
            MSG_DEBUG("pmmcImage->imageType = %d(0x%x)\n", pmmcImage->imageType, pmmcImage->imageType);

            if(pmmcImage->imageType == UBOOT) {
                blockCount = (pmmcImage->fileLength+IBR_HEADER_LEN+pmmcImage->initSize+((SD_SECTOR)-1))/(SD_SECTOR);
                pmmcImage->flashOffset = 0x400;
                MSG_DEBUG("blockCount = %d\n", blockCount);
                MSG_DEBUG("pmmcImage->flashOffset = %d(0x%x)\n", pmmcImage->flashOffset, pmmcImage->flashOffset);

                // Get DDR parameter length
                usb_recv(ptr,4);
                memcpy(&ddrlen,(unsigned char *)ptr,4);
                MSG_DEBUG("ddrlen = %d\n", ddrlen);
                usleep(1000);
                *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
                usb_send((unsigned char*)_ack,4);//send ack to PC

            } else {
                blockCount = (pmmcImage->fileLength+((SD_SECTOR)-1))/(SD_SECTOR);
                MSG_DEBUG("blockCount = %d\n", blockCount);
            }

            ptr=_ch;
            len=pmmcImage->fileLength;
            blockCount = (blockCount+SD_MUL-1)/SD_MUL;
            offset = pmmcImage->flashOffset/SD_SECTOR;
            if(pmmcImage->imageType==UBOOT) {
                fmiSD_Read(offset,SD_MUL,(UINT32)ptr);
                offset+=8;
                if(blockCount==1) {
                    ptr=_ch+(IBR_HEADER_LEN+pmmcImage->initSize);
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);   //recv data from PC
                } else {
                    INT32 mvlen,tranferlen;
                    tranferlen=len-IBR_HEADER_LEN-ddrlen;
                    mvlen=(SD_MUL*SD_SECTOR)-(IBR_HEADER_LEN+pmmcImage->initSize)-ddrlen;
                    memmove(_ch,_ch+(IBR_HEADER_LEN+pmmcImage->initSize)+ddrlen,mvlen);
                    for(i=1; i<blockCount; i++) {
                        ptr=_ch+mvlen;
                        fmiSD_Read(offset,8,(UINT32)ptr);
                        ptr=_ch;
                        usb_send(ptr,TRANSFER_LEN); //send data to PC
                        while(Bulk_Out_Transfer_Size==0) {}
                        usb_recv((unsigned char*)_ack,4);   //recv data from PC
                        tranferlen-=TRANSFER_LEN;
                        memmove(_ch,_ch+(SD_MUL*SD_SECTOR),mvlen);
                        offset+=SD_MUL;
                    }
                    if(tranferlen>0) {
                        MSG_DEBUG("Last transfer %d    0x%x\n", tranferlen, mvlen);
                        usb_send(ptr,TRANSFER_LEN); //send data to PC
                        //usb_send(ptr,tranferlen); //send data to PC
                        while(Bulk_Out_Transfer_Size==0) {}
                        usb_recv((unsigned char*)_ack,4); //recv data from PC
                    }
                }
            } else {
                for(i=0; i<blockCount; i++) {
                    fmiSD_Read(offset,SD_MUL,(UINT32)ptr);
                    usb_send(ptr,TRANSFER_LEN);//send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4);//recv data from PC
                    offset+=8;
                }
            }
        }
    }
    break;
    case FORMAT_MODE: { /* Format */
        unsigned int *ptr;
        UCHAR _fmi_ucBuffer[512];
        ptr = (unsigned int *)((UINT32)_fmi_ucBuffer | 0x80000000);
        MSG_DEBUG("eMMC format !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

