OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
        printf("pmmcImage->ReserveSize = %d ! eMMCBlockSize = %d\n",pmmcImage->ReserveSize, eMMCBlockSize);
        MSG_DEBUG("PartitionNum =%d, P1=%d(0x%x)MB P2=%d(0x%x)MB P3=%d(0x%x)MB P4=%d(0x%x)MB\n", pmmcImage->PartitionNum, pmmcImage->PartitionS1Size, pmmcImage->PartitionS1Size, pmmcImage->PartitionS2Size, pmmcImage->PartitionS2Size,
                  pmmcImage->PartitionS3Size, pmmcImage->PartitionS3Size, pmmcImage->PartitionS4Size, pmmcImage->PartitionS4Size);
        if(eMMCBlockSize>0) {
            //pmbr=create_mbr(eMMCBlockSize,pmmcImage->ReserveSize);
            //FormatFat32(pmbr,0);
            pmbr=create_mbr(eMMCBlockSize, pmmcImage);
            switch(pmmcImage->PartitionNum) {
            case 1:
                FormatFat32(pmbr,0);
                break;
            case 2: {
                FormatFat32(pmbr,0);
                FormatFat32(pmbr,1);
            }
            break;
            case 3: {
                FormatFat32(pmbr,0);
                FormatFat32(pmbr,1);
                FormatFat32(pmbr,2);
            }
            break;
            case 4: {
                FormatFat32(pmbr,0);
                FormatFat32(pmbr,1);
                FormatFat32(pmbr,2);
                FormatFat32(pmbr,3);
            }
            break;
            }

            fmiSD_Read(MMC_INFO_SECTOR,1,(UINT32)ptr);
            *(ptr+125)=0x11223344;
            *(ptr+126)=pmmcImage->ReserveSize;
            *(ptr+127)=0x44332211;
            fmiSD_Write(MMC_INFO_SECTOR,1,(UINT32)ptr);
            SendAck(100);
        } else
            SendAck(0xFFFFFFFF);
    }
    break;
    case READ_MODE: {
        MSG_DEBUG("MMC normal read !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        offset = pmmcImage->flashOffset;
        blockCount = (pmmcImage->fileLength+((SD_SECTOR)-1))/(SD_SECTOR);
        blockCount = (blockCount+8-1)/8;
        while(blockCount) {

            fmiSD_Read(offset,8,(UINT32)ptr);
            MSG_DEBUG("offset=0x%08x,ptr_addr=0x%08x,ptr=%d\n",offset,(UINT32)ptr,*(ptr));
            offset+=8;
            blockCount--;
            usb_send(ptr,4096); //send data to PC
            while(Bulk_Out_Transfer_Size==0) {}
            usb_recv((unsigned char*)_ack,4);   //recv data from PC
        }
    }
    break;
    case PACK_MODE: {
        MSG_DEBUG("MMC normal pack !!!\n");

        /* for debug or delay */
        {
            usleep(1000);
            *_ack=(USBD_BURN_TYPE | USBD_FLASH_MMC);
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        {
            PACK_HEAD pack;
            PACK_CHILD_HEAD ppack;
            while(1) {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_HEAD)) {
                    usb_recv(ptr,sizeof(PACK_HEAD));
                    memcpy(&pack,(unsigned char *)ptr,sizeof(PACK_HEAD));
                    *_ack=sizeof(PACK_HEAD);
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }
            MSG_DEBUG("pack.actionFlag=0x%x, pack.fileLength=0x%08x pack.num=%d!!!\n",pack.actionFlag,pack.fileLength,pack.num);
            for(i=0; i<pack.num; i++) {
                while(1) {
                    if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD)) {
                        usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                        memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                        *_ack=sizeof(PACK_CHILD_HEAD);
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        break;
                    }
                }
                MSG_DEBUG("ppack.filelen=0x%x, ppack.startaddr=0x%08x!!!\n",ppack.filelen,ppack.startaddr);
                if(ppack.imagetype!=PMTP) {
                    if(ppack.imagetype==UBOOT)
                        ppack.startaddr=0x400;
                    BatchBurn_MMC(ppack.filelen,ppack.startaddr/SD_SECTOR,0);
                }
            }
        }
    }
    break;
    }
}

/******************************************************************************
 *
 *  NAND Functions
 *
 ******************************************************************************/
FW_NAND_IMAGE_T nandImage;
FW_NAND_IMAGE_T *pNandImage;

void Burn_NAND_RAW(UINT32 len, UINT8 *ptr)
{
    MSG_DEBUG("len=%d\n",len);
}

void Read_NAND_RAW(UINT32 len, UINT8 *ptr)
{
    MSG_DEBUG("len=%d\n", len);
}

#define DISABLE_YAFFS2
#if defined(BATCH_BRUN)
int BatchBurn_NAND(UINT32 len,UINT32 blockNo,UINT32 type)
{
    int volatile status = 0;
    int volatile page_count, block_count, page, addr, blockNum, total;
    int volatile i, j, pagetmp=0;
    unsigned int address = DOWNLOAD_BASE;

    unsigned int sparesize;  //Put yaffs2 tag on the oob(sparesize).

    unsigned char *_ch,*ptr;
    unsigned int *_ack,ack=0;
    unsigned int reclen,remainlen;
    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));
    ptr=_ch;

#ifndef DISABLE_YAFFS2
    if(type==YAFFS2 && (len%512)!=0)
        sparesize=pSM->uSpareSize;
    else
#endif
        sparesize=0;

    page_count = len / (pSM->uPageSize+sparesize);
    if(len%(pSM->uPageSize+sparesize)!=0) page_count++;
    // erase needed blocks
    block_count = page_count / (pSM->uPagePerBlock);


    // write into flash
    blockNum = blockNo;
    total = len;
    MSG_DEBUG("blockNum=%d,total=%d\n",blockNum,total);
    for (j=0; j<block_count; j++) {
        MSG_DEBUG("%d,%d\n",j,block_count);
        ptr=_ch;
        remainlen=MIN(total,pSM->uPagePerBlock*(pSM->uPageSize+sparesize));
        do {
            if(Bulk_Out_Transfer_Size>0) {
                MSG_DEBUG("total=%08d,remainlen=%08d\n",total,remainlen);
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                total-=reclen;
                *_ack=reclen;//|((pagetmp * 95) / total)<<16;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while(remainlen!=0);

        MSG_DEBUG("remainlen OK\n");
_retry_1:
        addr = address | NON_CACHE;
        page = pSM->uPagePerBlock * (blockNum);
        MSG_DEBUG("fmiSM_BlockErase page = %d   blockNum = %d   addr =0x%x\n", page, blockNum, addr);
        status = fmiSM_BlockErase(pSM, blockNum); // block erase
        //if (status != 0) {
        if (status == 1) {
            fmiMarkBadBlock(pSM, blockNum);
            blockNum++;
            goto _retry_1;
        } else if (status == -1) {
            MSG_DEBUG("Error device error !! \n");

            usb_recv(ptr,Bulk_Out_Transfer_Size);  //recv data from PC
            //SendAck(0xffff);
            *_ack=0xffff;
            usb_send((unsigned char*)_ack,4);//send ack to PC
            return status;
        }
        MSG_DEBUG("pSM->uPagePerBlock=%08d\n",pSM->uPagePerBlock);
        // write block
        for (i=0; i<pSM->uPagePerBlock; i++) {
#ifndef DISABLE_YAFFS2
            if(type==YAFFS2 && (len%512)!=0) {
                status = fmiSM_Write_large_page_oob(page+i, 0, addr,pSM->uSpareSize);
            } else
#endif
                status = fmiSM_Write_large_page(page+i, 0, addr);

            if (status != 0) {
                fmiMarkBadBlock(pSM, blockNum);
                blockNum++;
                goto _retry_1;
            }
            addr += pSM->uPageSize;
#ifndef DISABLE_YAFFS2
            if(type==YAFFS2 && (len%512)!=0)
                addr += (pSM->uPageSize>>5);
#endif
            pagetmp++;
        }
        blockNum++;
    }
    MSG_DEBUG("page_count=%d,pSM->uPagePerBlock=%d\n",page_count,pSM->uPagePerBlock);
    if ((page_count % pSM->uPagePerBlock) != 0) {
        MSG_DEBUG("Cnt=%d\n",page_count % pSM->uPagePerBlock);
        memset(_ch,0xff,pSM->uPagePerBlock*(pSM->uPageSize+sparesize));
        ptr=_ch;
        remainlen=total;//(len-block_count*(pSM->uPagePerBlock*(pSM->uPageSize+sparesize)));
        do {
            if(Bulk_Out_Transfer_Size>0) {
                MSG_DEBUG("remainlen=%d\n",remainlen);
                reclen=MIN(TRANSFER_LEN,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                total-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while(remainlen!=0);
        page_count = page_count - block_count * pSM->uPagePerBlock;
        MSG_DEBUG("page_count=%d\n",page_count);
_retry_2:
        addr = address | NON_CACHE;
        page = pSM->uPagePerBlock * (blockNum);
        status = fmiSM_BlockErase(pSM, blockNum);      // erase block
        //if (status != 0) {
        if (status == 1) {
            fmiMarkBadBlock(pSM, blockNum);
            blockNum++;
            goto _retry_2;
        } else if (status == -1) {
            MSG_DEBUG("device error !! \n");
            SendAck(0xffff);
            return status;
        }
        // write block
        MSG_DEBUG("page_count=%d,type=%d\n",page_count,type);
        for (i=0; i<page_count; i++) {
            MSG_DEBUG("i=%d\n",i);
#ifndef DISABLE_YAFFS2
            if(type==YAFFS2 && (len%512)!=0)
                status = fmiSM_Write_large_page_oob(page+i, 0, addr,pSM->uPageSize>>5);
            else
#endif
                status = fmiSM_Write_large_page(page+i, 0, addr);

            if (status != 0) {
                fmiMarkBadBlock(pSM, blockNum);
                blockNum++;
                goto _retry_2;
            }
            addr += pSM->uPageSize;
#ifndef DISABLE_YAFFS2
            if(type==YAFFS2 && (len%512)!=0)
                addr += (pSM->uPageSize>>5);
#endif
            pagetmp++;
        }
        blockNum++;
    }

    SendAck(blockNum-blockNo);
    return status;
}
#endif


int BatchBurn_NAND_Data_OOB(UINT32 len,UINT32 blockNo,UINT32 type)
{
    int volatile status = 0;
    int volatile page_count, block_count, page, addr, blockNum, total;
    int volatile i, j, pagetmp=0;
    unsigned int address = DOWNLOAD_BASE;
    unsigned int BurnLen;
    unsigned int sparesize;  //Put yaffs2 tag on the oob(sparesize).

    unsigned char *_ch,*ptr;
    unsigned int *_ack,ack=0;
    unsigned int reclen,remainlen;
    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));
    ptr=_ch;

    sparesize=pSM->uSpareSize;
    page_count = len / (pSM->uPageSize+sparesize);
    if(len%(pSM->uPageSize+sparesize)!=0) page_count++;
    // erase needed blocks
    block_count = page_count / (pSM->uPagePerBlock);


