OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
    // write into flash
    blockNum = blockNo;
    total = len;
    BurnLen=(pSM->uPageSize+sparesize);
    MSG_DEBUG("blockNum=%d,total=%d,block_count=%d\n",blockNum,total,block_count);
    for (j=0; j<block_count; j++) {
        MSG_DEBUG("%d,%d\n",j,block_count);
        ptr=_ch;
        remainlen=MIN(total,pSM->uPagePerBlock*(pSM->uPageSize+sparesize));
        do {
            if(Bulk_Out_Transfer_Size>0) {
                MSG_DEBUG("total=%08d,remainlen=%08d\n",total,remainlen);
                reclen=MIN(BurnLen,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                total-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while(remainlen!=0);

        MSG_DEBUG("remainlen OK\n");
//_retry_1:
        addr = address | NON_CACHE;
        page = pSM->uPagePerBlock * (blockNum);
        status = fmiSM_BlockEraseBad(pSM, blockNum); // block erase
        // write block
        for (i=0; i<pSM->uPagePerBlock; i++) {
            status = fmiSM_Write_large_page_oob2(page+i, 0, addr);
//             if (status != 0)
//             {
//                 fmiMarkBadBlock(pSM, blockNum);
//                 blockNum++;
//                 goto _retry_1;
//             }
            addr += pSM->uPageSize+sparesize;
            pagetmp++;
            //SendAck((pagetmp * 95) / total);
        }
        blockNum++;
    }
    MSG_DEBUG("page_count=%d,pSM->uPagePerBlock=%d\n",page_count,pSM->uPagePerBlock);

    //SendAck(100);
    SendAck(blockNum-blockNo);
    return status;
}

int Read_Nand(UINT32 dst_adr,UINT32 blockNo, UINT32 len)
{
    volatile char *ptr;
    int spareSize;
    int volatile status = 0;
    int volatile page_count, block_count, blockNum;
    int volatile page_no, count, i=0, j=0, k;

    page_count = len / pSM->uPageSize;
    if ((len % pSM->uPageSize) != 0) page_count++;
    blockNum = blockNo;
    count = len;
    while(1) {
        MSG_DEBUG("blockNum=%d to start reading...\n",blockNum);
        if (fmiCheckInvalidBlock(pSM, blockNum) != 1) {
            for (i=0; i<pSM->uPagePerBlock; i++) {
                page_no = blockNum * pSM->uPagePerBlock + i;

                //--- read redunancy area to register SMRAx
                spareSize = inpw(REG_NANDRACTL) & 0x1ff;
                ptr = (volatile char *)REG_NANDRA0;
                fmiSM_Read_RA(page_no, pSM->uPageSize);
                for (k=0; k<spareSize; k++)
                    *ptr++ = inpw(REG_NANDDATA) & 0xff;                   // copy RA data from NAND to SMRA by SW
                fmiSM_Read_large_page(pSM, page_no, (UINT32)dst_adr);
                dst_adr += pSM->uPageSize;
                count -= pSM->uPageSize;
                MSG_DEBUG("pSM->uPagePerBlock=%d   --> %d...0x%x \n",pSM->uPagePerBlock, i, dst_adr);
            }
            j++;

        } else {
            printf("block%d is bad block...\n",blockNum);
        }
        blockNum++;
        if ((j >= block_count) || (count <= 0))
            break;
    }

    return 0;
}

int Read_Nand_Redunancy(UINT32 dst_adr,UINT32 blockNo, UINT32 len)
{
    volatile char *ptr;
    volatile char *dst_redunancy_adr;
    int spareSize;
    int volatile status = 0;
    int volatile page_count, block_count, blockNum;
    int volatile page_no, count, i=0, j=0, k;

    page_count = len / pSM->uPageSize;
    if ((len % pSM->uPageSize) != 0) page_count++;
    blockNum = blockNo;
    block_count = page_count / pSM->uPagePerBlock;
    if ((page_count % pSM->uPagePerBlock) != 0)
        block_count++;
    count = len;
    while(1) {
        MSG_DEBUG("blockNum=%d to start reading...\n",blockNum);
        for (i=0; i<pSM->uPagePerBlock; i++) {
            dst_redunancy_adr=(volatile char *)(dst_adr + pSM->uPageSize);
            page_no = blockNum * pSM->uPagePerBlock + i;
            //--- read redunancy area to register SMRAx
            spareSize = inpw(REG_NANDRACTL) & 0x1ff;
            ptr = (volatile char *)REG_NANDRA0;
            fmiSM_Read_RA(page_no, pSM->uPageSize);
            for (k=0; k<spareSize; k++) {
                *dst_redunancy_adr = inpw(REG_NANDDATA) & 0xff;// copy RA data from NAND to SMRA by SW
                *ptr++ = *dst_redunancy_adr;
                dst_redunancy_adr++;
            }
            fmiSM_Read_large_page(pSM, page_no, (UINT32)dst_adr);
            dst_adr += (pSM->uPageSize+pSM->uSpareSize);
            count -= (pSM->uPageSize+pSM->uSpareSize);
        }
        j++;
        blockNum++;
        if ((j >= block_count) || (count <= 0))
            break;
    }
    return 0;
}

#if defined(BATCH_BRUN)
int BatchBurn_NAND_BOOT(UINT32 len,UINT32 blockNo,UINT32 blockLen,UINT32 HeaderFlag)
{
    int volatile status = 0;
    int volatile page_count, block_count, page, addr, blockNum, total;
    int volatile blkindx,i, j, pagetmp=0;
    unsigned int address = DOWNLOAD_BASE;

    unsigned char *_ch,*ptr;
    unsigned int *_ack,ack=0;
    unsigned int reclen,remainlen;
    unsigned int headlen;

    if(HeaderFlag==1)
        headlen=IBR_HEADER_LEN;//16;
    else
        headlen=0;

    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));
    ptr=_ch;
    page_count = len / pSM->uPageSize;
    if ((len % pSM->uPageSize) != 0)
        page_count++;

    // write into flash
    blockNum = blockNo;
    total = page_count*blockLen;

    // define for USB ack
    addr = address | NON_CACHE;

    // erase needed blocks
    block_count = page_count / pSM->uPagePerBlock;
    if (page_count <= pSM->uPagePerBlock) {
        //page_count = page_count - block_count * pSM->uPagePerBlock;
        memset(_ch+headlen,0xff,pSM->uPagePerBlock*(pSM->uPageSize));
        ptr=_ch+headlen;
        remainlen=len-(block_count*pSM->uPagePerBlock*pSM->uPageSize)-headlen;
        MSG_DEBUG("remainlen=%d,block_count=%d\n",remainlen,block_count);
        do {
            if(Bulk_Out_Transfer_Size>0) {
                reclen=MIN(Bulk_Out_Transfer_Size,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen|((pagetmp * 95) / total)<<16;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while(remainlen!=0);
        // erase block
//_retry_2:
        for(blkindx=blockNum; blkindx<blockLen; blkindx++) {
            addr = address | NON_CACHE;
            page = pSM->uPagePerBlock * (blkindx);
            status = fmiSM_BlockErase(pSM, blkindx);
            if (status != 0) {
                fmiMarkBadBlock(pSM, blkindx);
                //blockNum++;
                //goto _retry_2;
                continue;
            }

            // write block
            for (i=0; i<page_count; i++) {
                status = fmiSM_Write_large_page(page+i, 0, addr);
                if (status != 0) {
                    fmiMarkBadBlock(pSM, blkindx);
                    //blockNum++;
                    addr = (address + block_count * pSM->uPagePerBlock * pSM->uPageSize) | NON_CACHE;
                    //goto _retry_2;
                    continue;
                }
                addr += pSM->uPageSize;
                pagetmp++;
            }
        }
        blockNum++;
    } else {
        printf("Error Device image Error !!!\n");
        usb_recv(ptr, Bulk_Out_Transfer_Size);  //recv data from PC
        *_ack = 0xFFFF;
        usb_send((unsigned char*)_ack,4);//send ack to PC
        return -1;
    }
    SendAck(block_count+blockLen);
    MSG_DEBUG("SendAck 0x%x\n", block_count+blockLen);
    return status;
}
#endif

int Burn_NAND_BACKUP(UINT32 len,UINT32 blockNo)
{
    int volatile status = 0;
    int volatile page_count, block_count, page, addr, blockNum, total;
    int volatile i, j, pagetmp=0;
    unsigned int address = DOWNLOAD_BASE;
    page_count = len / pSM->uPageSize;
    if ((len % pSM->uPageSize) != 0)
        page_count++;

