OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
    // write into flash
    blockNum = blockNo;
    total = page_count;

    // define for USB ack
    addr = address | NON_CACHE;

    // erase needed blocks
    block_count = page_count / pSM->uPagePerBlock;

    for (j=0; j<block_count; j++) {
        // block erase
//_retry_1:
        page = pSM->uPagePerBlock * (blockNum);
        status = fmiSM_BlockErase(pSM, blockNum);
        if (status != 0) {
            fmiMarkBadBlock(pSM, blockNum);
            MSG_DEBUG("bad block = %d\n",blockNum);
            blockNum++;
            continue;
        }

        // write block
        for (i=0; i<pSM->uPagePerBlock; i++) {
            status = fmiSM_Write_large_page(page+i, 0, addr);
            if (status != 0) {
                fmiMarkBadBlock(pSM, blockNum);
                MSG_DEBUG("bad block = %d\n",blockNum);
                blockNum++;
                addr = (address + j * pSM->uPagePerBlock * pSM->uPageSize) | NON_CACHE;
                continue;
            }
            addr += pSM->uPageSize;
            pagetmp++;
        }
        blockNum++;
    }

    if ((page_count % pSM->uPagePerBlock) != 0) {
        page_count = page_count - block_count * pSM->uPagePerBlock;
        block_count++;
        // erase block
//_retry_2:
        page = pSM->uPagePerBlock * (blockNum);
        status = fmiSM_BlockErase(pSM, blockNum);
        if (status != 0) {
            fmiMarkBadBlock(pSM, blockNum);
            blockNum++;
            //goto _retry_2;
            return status;
        }

        // write block
        for (i=0; i<page_count; i++) {
            status = fmiSM_Write_large_page(page+i, 0, addr);
            if (status != 0) {
                fmiMarkBadBlock(pSM, blockNum);
                blockNum++;
                addr = (address + block_count * pSM->uPagePerBlock * pSM->uPageSize) | NON_CACHE;
                //goto _retry_2;
                return status;
            }
            addr += pSM->uPageSize;
            pagetmp++;
        }
        blockNum++;
    }
    return status;
}

void UXmodem_NAND()
{
    int i,offset=0, ret;
    unsigned char *ptr;
    unsigned char buf[80];
    unsigned char *_ch;
    unsigned int *_ack;
    unsigned int len;
    PACK_CHILD_HEAD ppack;
    unsigned int ddrlen;
    unsigned int total,offblk=0;

    MSG_DEBUG("download image to NAND flash...\n");
    /* TODO: initial NAND */
    fmiNandInit();
    MSG_DEBUG("g_uIsUserConfig=%d\n",g_uIsUserConfig);
    MSG_DEBUG("UXmodem_NAND BlockPerFlash=%d\n",pSM->uBlockPerFlash);
    MSG_DEBUG("UXmodem_NAND PagePerBlock=%d\n",pSM->uPagePerBlock);
    MSG_DEBUG("UXmodem_NAND PageSize=%d\n",pSM->uPageSize);
    memset((char *)&nandImage, 0, sizeof(FW_NAND_IMAGE_T));
    pNandImage = (FW_NAND_IMAGE_T *)&nandImage;

    _ch=((unsigned char*)(((unsigned int)buf)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    ptr=_ch;
    while(1) {
        if(Bulk_Out_Transfer_Size>0) {
            usb_recv(ptr,sizeof(FW_NAND_IMAGE_T));
            memcpy(pNandImage, (unsigned char *)ptr, sizeof(FW_NAND_IMAGE_T));
            break;
        }
    }
    MSG_DEBUG("action flag %d, blockNo %d len 0x%x(%d)\n", pNandImage->actionFlag,pNandImage->blockNo, pNandImage->fileLength, pNandImage->fileLength);

    switch (pNandImage->actionFlag) {
    case WRITER_MODE: { // normal write
        MSG_DEBUG("NAND normal write !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x83;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        MSG_DEBUG("NAND normal write2 !!!\n");
        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

        if (pNandImage->imageType == UBOOT) { // system image
            pNandImage->imageNo = 0;
            pNandImage->blockNo = 0;
            addMagicHeader(pNandImage->executeAddr, pNandImage->fileLength);
            addNUC980MagicHeader(1);
            ptr += IBR_HEADER_LEN;// except the 32 bytes magic header
            offset = IBR_HEADER_LEN;
        } else
            offset = 0;

        len=pSM->uPagePerBlock*pSM->uPageSize;
        MSG_DEBUG("NAND normal Burn_NAND !!!\n");
        if (pNandImage->imageType == UBOOT) {   // system image
            BatchBurn_NAND_BOOT(pNandImage->fileLength + offset +((FW_NAND_IMAGE_T *)pNandImage)->initSize,0,4,1);
            MSG_DEBUG("pNandImage->fileLength = 0x%x\n", pNandImage->fileLength);
        } else {
            if(pNandImage->imageType!=IMAGE) {
                if(pNandImage->imageType == DATA_OOB) {
                    MSG_DEBUG("DATA_OOB type\n");
                    BatchBurn_NAND_Data_OOB(pNandImage->fileLength + offset +((FW_NAND_IMAGE_T *)pNandImage)->initSize,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize),pNandImage->imageType);
                } else {
                    BatchBurn_NAND(pNandImage->fileLength + offset +((FW_NAND_IMAGE_T *)pNandImage)->initSize,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize),pNandImage->imageType);
                }
            } else {
                MSG_DEBUG("_ch[0]=%c,_ch[1]=%c,_ch[2]=%c,_ch[3]=%c\n",(char)_ch[0],(char)_ch[1],(char)_ch[2],(char)_ch[3]);
                if(((char)_ch[0])=='U' && ((char)_ch[1])=='B' && ((char)_ch[2])=='I') {
                    BatchBurn_NAND(pNandImage->fileLength + offset +((FW_NAND_IMAGE_T *)pNandImage)->initSize,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize),UBIFS);
                } else {
                    BatchBurn_NAND(pNandImage->fileLength + offset +((FW_NAND_IMAGE_T *)pNandImage)->initSize,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize),YAFFS2);
                }
            }
        }
    }
    break;

    case MODIFY_MODE: { // modify
        MSG_DEBUG("NAND modify !!!\n");
    }
    break;

    case ERASE_MODE: {  // erase
        MSG_DEBUG("NAND erase !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x83;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        MSG_DEBUG("\nstart=%d\n",pNandImage->blockNo); //start block
        MSG_DEBUG("length=%d\n",pNandImage->executeAddr); //block length
        MSG_DEBUG("type=%d\n",pNandImage->imageType); //0: chip erase, 1: erase accord start and length blocks.
        MSG_DEBUG("imageNo=0x%08x\n",pNandImage->imageNo);

        if(pNandImage->imageType==0) { //chip erase
            if (pNandImage->imageNo == 0xFFFFFFFF) {
                int bb;
                bb = fmiSM_ChipErase(0);
                if (bb < 0) {
                    MSG_DEBUG("ERROR: %d bad block\n", bb); // storage error
                    *_ack=0xffff;
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                } else
                    MSG_DEBUG("total %d bad block\n", bb);
            } else {
                fmiSM_ChipEraseBad(0);
            }
        } else {
            if (pNandImage->imageNo == 0xFFFFFFFF) {
                int bb;
                bb = fmiSM_Erase(0,pNandImage->blockNo,pNandImage->executeAddr);
                printf("total %d bad block\n", bb);
            } else {
                MSG_DEBUG("fmiSM_EraseBad\n");
                fmiSM_EraseBad(0,pNandImage->blockNo,pNandImage->executeAddr);
            }
        }
    }
    break;

    case VERIFY_MODE: { // verify
        MSG_DEBUG("NAND normal verify !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x83;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        {
            if (pNandImage->imageType == UBOOT) {   // system image
                int offblk=0;
                _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                ptr=_ch;
                while(fmiCheckInvalidBlock(pSM, pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk) == 1) {
                    offblk++;
                }
                Read_Nand(DOWNLOAD_BASE,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk,pNandImage->fileLength+IBR_HEADER_LEN+pNandImage->initSize);
                memmove(_ch,_ch+IBR_HEADER_LEN+pNandImage->initSize,pNandImage->fileLength);
                do {
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv data from PC
                    ptr += (*_ack);
                } while((ptr-_ch)<(pNandImage->fileLength));
            } else {
                int total,offblk=0;
                total=pNandImage->fileLength;
                do {
                    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                    ptr=_ch;
                    len=MIN(total,pSM->uPagePerBlock*pSM->uPageSize);
                    memset(ptr, 0xff, pSM->uPagePerBlock*pSM->uPageSize);
                    while(fmiCheckInvalidBlock(pSM, pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk) == 1) {
                        offblk++;
                    }
                    Read_Nand(DOWNLOAD_BASE,pNandImage->blockNo/(pSM->uPagePerBlock*pSM->uPageSize)+offblk,len);
                    MSG_DEBUG("Read_NAND offblk=%d,len=%d\n",offblk,len);
                    do {
                        usb_send(ptr,TRANSFER_LEN); //send data to PC
                        while(Bulk_Out_Transfer_Size==0) {}
                        usb_recv((unsigned char*)_ack,4); //recv data from PC
                        ptr += (*_ack);
                        MSG_DEBUG("read size=0x%08x\n",(unsigned int)(ptr-_ch));
                    } while((int)(ptr-_ch)<len);
                    total-=len;
                    offblk+=1;
                    MSG_DEBUG("total=%d len=%d\n",total,len);
                } while(total!=0);
            }
        }
    }
    break;
    case PACK_VERIFY_MODE: { // verify
        MSG_DEBUG("\n NAND PACK verify !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x83;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        //printf("PACK_VERIFY_MODE pNandImage->imageNo= %d\n", pNandImage->imageNo);
        for(i=0; i<pNandImage->imageNo; i++) {
            while(1) {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD)) {
                    usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                    memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                    usleep(1000);
                    *_ack=0x83;
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }

