OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
#if(0) // to do

    int volatile page_count, block_count, page, addr, blockNum, total;
    int volatile i, j, pagetmp=0;
    unsigned int address = DOWNLOAD_BASE;
    unsigned int BurnLen;
    unsigned int sparesize;  //Put yaffs2 tag on the oob(sparesize).

    unsigned char *_ch,*ptr;
    unsigned int *_ack,ack=0;
    unsigned int reclen,remainlen;
    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));
    ptr=_ch;

    sparesize=pSN->SPINand_SpareArea;
    page_count = len / (pSN->SPINand_PageSize+sparesize);
    if(len%(pSN->SPINand_PageSize+sparesize)!=0) page_count++;
    // erase needed blocks
    block_count = page_count / (pSN->SPINand_PagePerBlock);


    // write into flash
    blockNum = blockNo;
    total = len;
    BurnLen=(pSN->SPINand_PageSize+sparesize);
    MSG_DEBUG("blockNum=%d,total=%d,block_count=%d\n",blockNum,total,block_count);
    for (j=0; j<block_count; j++) {
        MSG_DEBUG("%d,%d\n",j,block_count);
        ptr=_ch;
        remainlen=MIN(total,pSN->SPINand_PagePerBlock*(pSN->SPINand_PageSize+sparesize));
        do {
            if(Bulk_Out_Transfer_Size>0) {
                MSG_DEBUG("total=%08d,remainlen=%08d\n",total,remainlen);
                reclen=MIN(BurnLen,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                total-=reclen;
                *_ack=reclen;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while(remainlen!=0);

        MSG_DEBUG("remainlen OK\n");
//_retry_1:
        addr = address | NON_CACHE;
        page = pSN->SPINand_PagePerBlock * (blockNum);
        status = fmiSM_BlockEraseBad(pSM, blockNum); // block erase
        // write block
        for (i=0; i<pSN->SPINand_PagePerBlock; i++) {
            status = fmiSM_Write_large_page_oob2(page+i, 0, addr);
//             if (status != 0)
//             {
//                 fmiMarkBadBlock(pSM, blockNum);
//                 blockNum++;
//                 goto _retry_1;
//             }
            addr += pSN->SPINand_PageSize+sparesize;
            pagetmp++;
            //SendAck((pagetmp * 95) / total);
        }
        blockNum++;
    }
    MSG_DEBUG("page_count=%d,pSN->SPINand_PagePerBlock=%d\n",page_count,pSN->SPINand_PagePerBlock);

    //SendAck(100);
    SendAck(blockNum-blockNo);

#endif
    return status;
}

int BatchBurn_SPINAND_BOOT(UINT32 len,UINT32 blockNo,UINT32 blockLen,UINT32 HeaderFlag)
{
    int volatile status = 0;
    int volatile page_count, block_count, page, addr, blockNum, total;
    int volatile blkindx,i, j, pagetmp=0;
    unsigned int address = DOWNLOAD_BASE;

    unsigned char *_ch,*ptr;
    unsigned int *_ack,ack=0;
    unsigned int reclen,remainlen;
    unsigned int headlen;

    if(HeaderFlag==1)
        headlen=IBR_HEADER_LEN;
    else
        headlen=0;

    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)ack)|NON_CACHE));
    ptr=_ch;
    page_count = len / pSN->SPINand_PageSize;
    if ((len % pSN->SPINand_PageSize) != 0)
        page_count++;

    // write into flash
    blockNum = blockNo;
    total = page_count*blockLen;

    // define for USB ack
    addr = address | NON_CACHE;

    // erase needed blocks
    block_count = page_count / (pSN->SPINand_PagePerBlock);
    MSG_DEBUG(">>>>>> len=%d  blockLen=%d  blockNum=%d    total=%d    block_count=%d  page_count =%d\n",len, blockLen, blockNum, total, block_count, page_count);

    if (page_count <= pSN->SPINand_PagePerBlock) {
        //page_count = page_count - block_count * pSM->uPagePerBlock;
        memset(_ch+headlen,0xff,(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize));
        ptr=_ch+headlen;
        remainlen=len-(block_count*pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)-headlen;
        MSG_DEBUG("remainlen=%d,block_count=%d\n",remainlen,block_count);
        do {
            if(Bulk_Out_Transfer_Size>0) {
                reclen=MIN(Bulk_Out_Transfer_Size,remainlen);
                usb_recv(ptr,reclen);  //recv data from PC
                ptr+=reclen;
                remainlen-=reclen;
                *_ack=reclen|((pagetmp * 95) / total)<<16;
                usb_send((unsigned char*)_ack,4);//send ack to PC
            }
        } while(remainlen!=0);
_retry_2:
        // erase block
        for(blkindx=blockNum; blkindx<blockLen; blkindx++) {
            addr = address | NON_CACHE;
            page = pSN->SPINand_PagePerBlock * (blkindx);
            MSG_DEBUG("blkindx = %d   page = %d   page_count=%d\n", blkindx, page, page_count);
            spiNAND_BlockErase(((page>>8)&0xFF), (page&0xFF)); // block erase
            status = spiNAND_StatusRegister(3);
            status = (status&0x0C)>>2;
            if (status != 0) {
                if(spiNAND_bad_block_check(page)==1) {
                    printf("Error bad_block blockNum = 0x%x(%d)\n", blockNum, blockNum);
                    blockNum++;
                    //continue;
                    goto _retry_2;
                }
            }
            // write block
            for (i=0; i<page_count; i++) {
                MSG_DEBUG("page+i=%d\n",page+i);
                spiNAND_Pageprogram_Pattern(0, 0, (uint8_t*)addr, pSN->SPINand_PageSize);
                spiNAND_Program_Excute((((page+i)>>8)&0xFF), (page+i)&0xFF);
                status = (spiNAND_StatusRegister(3) & 0x0C)>>2;
                if (status != 0) {
                    if(spiNAND_bad_block_check(page)==1) {
                        //spiNAND_bad_block_check(page);
                        blockNum++;
                        addr = (address + block_count * pSN->SPINand_PagePerBlock * pSN->SPINand_PageSize) | NON_CACHE;
                        goto _retry_2;
                    }
                }
                addr += pSN->SPINand_PageSize;
                pagetmp++;
            }
        }
        blockNum++;
    } else {
        printf("Error Device image Error !!!\n");
        usb_recv(ptr, Bulk_Out_Transfer_Size);  //recv data from PC
        *_ack = 0xFFFF;
        usb_send((unsigned char*)_ack,4);//send ack to PC
        return -1;
    }
    SendAck(block_count+blockLen);
    MSG_DEBUG("SendAck 0x%x\n", block_count+blockLen);
    return status;
}

int Read_SPINand(UINT32 dst_adr,UINT32 blockNo, UINT32 len)
{
//    volatile char *ptr;
    int volatile status = 0;
    int volatile page_count, blockNum;
    int volatile page_no, total, i=0, j=0, k;
    unsigned int block_count;

    MSG_DEBUG("len =%d, blockNo=%d    %d\n", len, blockNo, (pSN->SPINand_PageSize*pSN->SPINand_PagePerBlock));
    block_count = len / (pSN->SPINand_PageSize*pSN->SPINand_PagePerBlock);
    if ((len % (pSN->SPINand_PageSize*pSN->SPINand_PagePerBlock)) != 0) block_count++;
    blockNum = blockNo;
    total = len;

    while(1) {
        for (i=0; i<pSN->SPINand_PagePerBlock; i++) {
            page_no = (blockNum * pSN->SPINand_PagePerBlock) + i;
            //printf("page_no = %d   total=%d  pageSize=%d\n", page_no, total, pSN->SPINand_PageSize);
            spiNAND_PageDataRead((page_no>>8)&0xFF, (page_no&0xFF));// Read verify
            //spiNAND_QuadIO_Read(0, 0, (uint8_t*)dst_adr, pSN->SPINand_PageSize);
            spiNAND_Normal_Read(0, 0, (uint8_t*)dst_adr, pSN->SPINand_PageSize);
            status = spiNAND_Check_Embedded_ECC_Flag();
            if(status != 0x00 && status != 0x01) {
                printf("Error ECC status error [0x%x]\n",status);// Check ECC status and return fail if (ECC-1, ECC0) != (0,0) or != (0,1)
            }
            dst_adr += pSN->SPINand_PageSize;
            total -= pSN->SPINand_PageSize;
        }
        j++;
        blockNum++;
        if ((j >= block_count) || (total <= 0))
            break;
    }

    MSG_DEBUG("End Read_SPINand  total = %d\n", total);
    return 0;
}

void UXmodem_SPINAND()
{
    int i,offset=0, ret;
    unsigned char *ptr;
    unsigned char buf[80];
    unsigned char *_ch;
    unsigned int *_ack;
    unsigned int len, offblk=0;
    PACK_CHILD_HEAD ppack;
    unsigned int volatile blockNum, total, block_cnt, totalblock;
    unsigned int volatile PA_Num, badBlock = 0;
    unsigned int ddrlen;

    MSG_DEBUG("\n SPI NAND flash...\n");
    /* Initial SPI NAND */
    spiNANDInit();

    MSG_DEBUG("pSN->SPINand_PageSize=%d\n",pSN->SPINand_PageSize);
    MSG_DEBUG("pSN->SPINand_PagePerBlock=%d\n",pSN->SPINand_PagePerBlock);

    memset((char *)&spinandImage, 0, sizeof(FW_SPINAND_IMAGE_T));
    pspiNandImage = (FW_SPINAND_IMAGE_T *)&spinandImage;

    _ch=((unsigned char*)(((unsigned int)buf)|NON_CACHE));
    _ack=((unsigned int*)(((unsigned int)buf)|NON_CACHE));
    ptr=_ch;
    while(1) {
        if(Bulk_Out_Transfer_Size>0) {
            usb_recv(ptr,sizeof(FW_SPINAND_IMAGE_T));
            memcpy(pspiNandImage, (unsigned char *)ptr, sizeof(FW_SPINAND_IMAGE_T));
            break;
        }
    }
    MSG_DEBUG("Action flag %d, blockNo %d len 0x%x(%d)\n", pspiNandImage->actionFlag,pspiNandImage->blockNo, pspiNandImage->fileLength, pspiNandImage->fileLength);
    switch (pspiNandImage->actionFlag) {
    case WRITER_MODE: { // normal write
        MSG_DEBUG("SPI NAND normal write !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x89;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        MSG_DEBUG("SPI NAND normal write2 !!!\n");
        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;

