OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
        if (pspiNandImage->imageType == UBOOT) { // system image
            pspiNandImage->imageNo = 0;
            pspiNandImage->blockNo = 0;
            addMagicHeader(pspiNandImage->executeAddr, pspiNandImage->fileLength);
            addNUC980MagicHeader(0);
            ptr += IBR_HEADER_LEN;  // except the 32 bytes magic header
            offset = IBR_HEADER_LEN;
        } else
            offset = 0;

        len = pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize;
        MSG_DEBUG("SPI NAND normal BatchBurn_SPINAND !!! page_count=0x%x(%d)\n", len, len);
        MSG_DEBUG("\nimageNo=%d, blockNo=%d executeAddr=0x%x  fileLength=%d    len = %d\n", pspiNandImage->imageNo,pspiNandImage->blockNo, pspiNandImage->executeAddr, pspiNandImage->fileLength, len);
        if (pspiNandImage->imageType == UBOOT) {   // system image
            BatchBurn_SPINAND_BOOT(pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,0,4,1);
            MSG_DEBUG("BatchBurn_SPINAND_BOOT(%d   ,0,4,1)\n", pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize);
        } else {
            if(pspiNandImage->imageType!=IMAGE) {
                if(pspiNandImage->imageType == DATA_OOB) {
                    MSG_DEBUG("DATA_OOB type\n");
                    // to do
                    //BatchBurn_SPINAND_Data_OOB(pSN, pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize),pspiNandImage->imageType);
                } else {
                    MSG_DEBUG("BatchBurn_SPINAND(0x%x,  0x%x,  0x%x)\n", pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize, pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize), pspiNandImage->imageType);
                    BatchBurn_SPINAND(pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSM->uPageSize),pspiNandImage->imageType);
                    MSG_DEBUG("BatchBurn_SPINAND(%d   %d   %d  )\n", pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize, pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize), pspiNandImage->imageType);
                    MSG_DEBUG("BatchBurn_SPINAND offset = %d    ((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize  %d \n", pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSM->uPageSize), ((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize);
                }
            } else {
                MSG_DEBUG("_ch[0]=%c,_ch[1]=%c,_ch[2]=%c,_ch[3]=%c\n",(char)_ch[0],(char)_ch[1],(char)_ch[2],(char)_ch[3]);
                if(((char)_ch[0])=='U' && ((char)_ch[1])=='B' && ((char)_ch[2])=='I') {
                    BatchBurn_SPINAND(pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize),UBIFS);
                } else {
                    MSG_DEBUG("BatchBurn_SPINAND(0x%x,  0x%x,  0x%x)\n", pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize, pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize), YAFFS2);
                    BatchBurn_SPINAND(pspiNandImage->fileLength + offset +((FW_SPINAND_IMAGE_T *)pspiNandImage)->initSize,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize),YAFFS2);
                }
            }
        }
    }
    break;
    case MODIFY_MODE: { // modify
        MSG_DEBUG("SPI NAND modify !!!\n");
    }
    break;
    case ERASE_MODE: {  // erase
        MSG_DEBUG("SPI NAND erase !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x89;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        MSG_DEBUG("\nstart=%d\n",pspiNandImage->blockNo); //start block
        MSG_DEBUG("length=%d\n",pspiNandImage->executeAddr); //block length
        MSG_DEBUG("type=%d, pspiNandImage->imageNo=0x%x\n",pspiNandImage->imageType, pspiNandImage->imageNo); //0: chip erase, 1: erase accord start and length blocks.
        MSG_DEBUG("imageNo=0x%08x\n",pspiNandImage->imageNo);
        MSG_DEBUG("SPINand_BlockPerFlash=0x%08x(%d)\n",pSN->SPINand_BlockPerFlash, pSN->SPINand_BlockPerFlash);
        MSG_DEBUG("SPINand_PagePerBlock=0x%08x(%d)\n",pSN->SPINand_PagePerBlock, pSN->SPINand_PagePerBlock);
        MSG_DEBUG("SPINand_PageSize=0x%08x(%d)\n",pSN->SPINand_PageSize, pSN->SPINand_PageSize);

        if(pspiNandImage->imageType==0) { //all chip erase
            usb_send((unsigned char*)&pSN->SPINand_BlockPerFlash,4);//send Erase block size to PC
            if (pspiNandImage->imageNo == 0xFFFFFFFF) {
                uint8_t volatile SR;
                for(blockNum=0; blockNum < pSN->SPINand_BlockPerFlash; blockNum++) {
                    PA_Num = blockNum*pSN->SPINand_PagePerBlock;
                    if(spiNAND_bad_block_check(PA_Num) == 1) {
                        badBlock++;
                        *_ack=blockNum;
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        printf("bad_block  blockNum = %d \n", blockNum);
                    } else {
                        spiNAND_BlockErase( (PA_Num>>8)&0xFF, PA_Num&0xFF);
                        SR = spiNAND_Check_Program_Erase_Fail_Flag();
                        if (SR != 0) {
                            *_ack=0xffff;
                            usb_send((unsigned char*)_ack,4);//send ack to PC
                            printf("Error SR = 0x%x  blockNum = %d\n", SR, blockNum); // storage error
                        } else {
                            *_ack=blockNum;
                            usb_send((unsigned char*)_ack,4);//send ack to PC
                            //printf("BlockErase %d Done\n", blockNum);
                        }
                    }
                }
            } else { // To do
                //fmiSM_ChipEraseBad(0);
            }
        } else { // Erase accord start and length blocks
            usb_send((unsigned char*)&pspiNandImage->executeAddr,4);// send Erase block size to PC
            MSG_DEBUG("#2740 pspiNandImage->executeAddr = 0x%x   pspiNandImage->blockNo= %d\n",  pspiNandImage->executeAddr, pspiNandImage->blockNo);
            if (pspiNandImage->imageNo == 0xFFFFFFFF) {
                uint8_t volatile SR;
                uint32_t volatile cnt = 0;
                for(blockNum=pspiNandImage->blockNo; blockNum < (pspiNandImage->blockNo+pspiNandImage->executeAddr); blockNum++) {
                    PA_Num = blockNum*pSN->SPINand_PagePerBlock;
#if(1)
                    if(spiNAND_bad_block_check(PA_Num) == 1) {
                        printf("bad_block  blockNum = %d \n", blockNum);
                        badBlock++;
                        continue;
                    }
#endif
                    spiNAND_BlockErase( (PA_Num>>8)&0xFF, PA_Num&0xFF);
                    SR = spiNAND_Check_Program_Erase_Fail_Flag();
                    if (SR != 0) {
                        printf("Error SR = 0x%x  blockNum = %d\n", SR, blockNum); // storage error
                        *_ack=0xffff;
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                    } else {
                        *_ack=cnt++;//blockNum;
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        MSG_DEBUG("blockNum = %d \n", _ack);
                    }
                }
            }
#if(0) // To do
            else {

                //fmiSM_EraseBad(0,pspiNandImage->blockNo,pspiNandImage->executeAddr);
                MSG_DEBUG("fmiSM_EraseBad\n");
            }
#endif
        }
    }
    break;
    case VERIFY_MODE: { // verify
        MSG_DEBUG("SPI NAND normal verify !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x89;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }
        {
            if (pspiNandImage->imageType == UBOOT) {   // system image
                int volatile offblk=0;
                _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                ptr=_ch;
                while(spiNAND_bad_block_check(pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)+offblk) == 1) {
                    offblk++;
                }
                MSG_DEBUG("offblk %d\n", offblk);
                Read_SPINand(DOWNLOAD_BASE,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)+offblk,pspiNandImage->fileLength+IBR_HEADER_LEN+pspiNandImage->initSize);
                MSG_DEBUG("Read_Nand   0x%x, 0x%x, 0x%x\n", DOWNLOAD_BASE, pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)+offblk, pspiNandImage->fileLength+IBR_HEADER_LEN+pspiNandImage->initSize);

                memmove(_ch,_ch+IBR_HEADER_LEN+pspiNandImage->initSize,pspiNandImage->fileLength);
                MSG_DEBUG("memmove  0x%x, 0x%x, 0x%x\n", _ch, _ch+IBR_HEADER_LEN+pspiNandImage->initSize, pspiNandImage->fileLength);
                do {
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv data from PC
                    ptr += (*_ack);
                } while((ptr-_ch)<(pspiNandImage->fileLength));
            } else {
                int volatile total,offblk=0;
                total=pspiNandImage->fileLength;
                do {
                    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                    ptr=_ch;
                    len=MIN(total,pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
                    memset(ptr, 0xff, pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
#if(1)
                    PA_Num = pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
                    while(spiNAND_bad_block_check(PA_Num+offblk) == 1) {
                        offblk++;
                    }
#endif
                    Read_SPINand(DOWNLOAD_BASE,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)+offblk,len);
                    MSG_DEBUG("Read_NAND offblk=%d,len=%d\n",offblk,len);
                    do {
                        usb_send(ptr,TRANSFER_LEN); //send data to PC
                        while(Bulk_Out_Transfer_Size==0) {}
                        usb_recv((unsigned char*)_ack,4); //recv data from PC
                        ptr += (*_ack);
                        MSG_DEBUG("read size=0x%08x\n",(unsigned int)(ptr-_ch));
                    } while((int)(ptr-_ch)<len);
                    total-=len;
                    offblk+=1;
                    MSG_DEBUG("total=%d len=%d\n",total,len);
                } while(total!=0);
            }
        }
    }
    break;
    case PACK_VERIFY_MODE: { // verify
        MSG_DEBUG("\n SPI NAND PACK verify !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x89;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        for(i=0; i<pspiNandImage->imageNo; i++) {
            while(1) {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD)) {
                    usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                    memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                    usleep(1000);
                    *_ack=0x89;
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }

