OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
            if (ppack.imagetype == UBOOT) {   // system image
                int offblk=0;
                int rawfilelen = 0;
                _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                ptr=_ch;
                while(spiNAND_bad_block_check(pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)+offblk) == 1) {
                    offblk++;
                }
                // Get DDR parameter length
                usb_recv(ptr,4);
                memcpy(&ddrlen,(unsigned char *)ptr,4);
                MSG_DEBUG("ddrlen = 0x%x(%d)\n", ddrlen, ddrlen);
                //usleep(1000);
                *_ack=0x89;
                usb_send((unsigned char*)_ack,4);//send ack to PC

                ret = Read_SPINand(DOWNLOAD_BASE,offblk,ppack.filelen+IBR_HEADER_LEN+ppack.startaddr);
                MSG_DEBUG("offblk = %d, ptr[0~3] = 0x%x  0x%x  0x%x  0x%x, 0x%x, ret=%d\n", offblk, ptr[0], ptr[1], ptr[2], ptr[3], ppack.filelen+IBR_HEADER_LEN+ppack.startaddr, ret);
                memmove(_ch,_ch+IBR_HEADER_LEN+ddrlen+ppack.startaddr,ppack.filelen);
                rawfilelen = ppack.filelen - (ddrlen+IBR_HEADER_LEN+ppack.startaddr);
                MSG_DEBUG("ppack.filelen = (%d) 0x%x,  rawfilelen = (%d)0x%x\n", ppack.filelen, ppack.filelen, rawfilelen, rawfilelen);
                do {
                    usb_send(ptr,TRANSFER_LEN); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv data from PC
                    ptr += (*_ack);
                } while((ptr-_ch)<(rawfilelen));

            } else {
                int total,offblk=0;
                total=ppack.filelen;
                pspiNandImage->blockNo = ppack.startaddr;
                do {
                    _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
                    ptr=_ch;

                    len=MIN(total,pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
                    memset(ptr, 0xff, pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
                    while(spiNAND_bad_block_check(pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)+offblk) == 1) {
                        offblk++;
                    }
                    Read_SPINand(DOWNLOAD_BASE,pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)+offblk,len);
                    MSG_DEBUG("Read_SPINAND offblk=%d,len=%d\n",offblk,len);
                    do {
                        usb_send(ptr,TRANSFER_LEN); //send data to PC
                        while(Bulk_Out_Transfer_Size==0) {}
                        usb_recv((unsigned char*)_ack,4); //recv data from PC
                        ptr += (*_ack);
                        MSG_DEBUG("read size=0x%08x\n",(unsigned int)(ptr-_ch));
                    } while((int)(ptr-_ch)<len);
                    total-=len;
                    offblk+=1;
                    MSG_DEBUG("total=%d len=%d\n",total,len);
                } while(total!=0);
            }
        }
    }
    break;
    case READ_MODE: { // read
        MSG_DEBUG("SPI NAND normal read !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x89;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        MSG_DEBUG("offset=%d,blockNo=%d,fileLength=%d\n",offset,pspiNandImage->blockNo,pspiNandImage->fileLength);
        block_cnt = 0;
        total=pspiNandImage->fileLength;
        totalblock = pspiNandImage->fileLength/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
        blockNum = pspiNandImage->blockNo;
        MSG_DEBUG("totalblock=%d  total=%d  blockNum=%d, blockNum+totalblock =%d\n",totalblock, total, blockNum, blockNum+totalblock);
        do {
            _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
            ptr=_ch;
            if(pspiNandImage->initSize==0) { //0: read good block , others : read redundancy area,good block and bad block
                len=MIN(total,pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize);
                memset(ptr, 0, len);
                PA_Num = blockNum*pSN->SPINand_PagePerBlock;
                MSG_DEBUG("PA_Num=0x%x(%d)  offblk=%d  blockNum=%d\n",PA_Num, PA_Num, offblk, blockNum);
#if(1)
                //while(spiNAND_bad_block_check(pspiNandImage->blockNo/(pSN->SPINand_PagePerBlock*pSN->SPINand_PageSize)+offblk) == 1) {
                while(spiNAND_bad_block_check(PA_Num+offblk) == 1) {
                    offblk++;
                }
#endif
                MSG_DEBUG("blockIdx =%d\n", blockNum+offblk);
                Read_SPINand(DOWNLOAD_BASE, blockNum+offblk ,len);
                do {
                    usb_send(ptr,4096); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv data from PC
                    ptr += (*_ack);
                } while((ptr-_ch)<len);
                total-=len;
                offblk+=1;
            } else {
#if(0) //To do
                len=MIN(total,pSN->SPINand_PagePerBlock*(pSN->SPINand_PageSize+pSN->SPINand_SpareArea));
                memset(ptr, 0, len);
                Read_Nand_Redunancy(DOWNLOAD_BASE,pNandImage->blockNo+offblk,len);
                do {
                    usb_send(ptr,pSN->SPINand_PageSize); //send data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv data from PC
                    ptr += (*_ack);
                    usb_send(ptr,pSN->SPINand_SpareArea); //send redundancy data to PC
                    while(Bulk_Out_Transfer_Size==0) {}
                    usb_recv((unsigned char*)_ack,4); //recv redundancy data from PC
                    ptr += (*_ack);
                } while((ptr-_ch)<len);
                total-=(len);
                offblk+=1;
#endif
            }
        } while(total!=0);
    }
    break;
    case PACK_MODE: {
        MSG_DEBUG("SPI NAND pack mode !!!\n");
        /* for debug or delay */
        {
            usleep(1000);
            *_ack=0x89;
            usb_send((unsigned char*)_ack,4);//send ack to PC
        }

        _ch=((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
        ptr=_ch;
        {
            PACK_HEAD pack;
            PACK_CHILD_HEAD ppack;
            while(1) {
                if(Bulk_Out_Transfer_Size>=sizeof(PACK_HEAD)) {
                    usb_recv(ptr,sizeof(PACK_HEAD));
                    memcpy(&pack,(unsigned char *)ptr,sizeof(PACK_HEAD));
                    *_ack=sizeof(PACK_HEAD);
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            }
            MSG_DEBUG("pack.actionFlag=0x%x, pack.fileLength=0x%08x pack.num=%d!!!\n",pack.actionFlag,pack.fileLength,pack.num);
            for(i=0; i<pack.num; i++) {
                while(1) {
                    if(Bulk_Out_Transfer_Size>=sizeof(PACK_CHILD_HEAD)) {
                        usb_recv(ptr,sizeof(PACK_CHILD_HEAD));
                        memcpy(&ppack,(unsigned char *)ptr,sizeof(PACK_CHILD_HEAD));
                        *_ack=sizeof(PACK_CHILD_HEAD);
                        usb_send((unsigned char*)_ack,4);//send ack to PC
                        break;
                    }
                }
                MSG_DEBUG("%d ppack.filelen=0x%x, ppack.startaddr=0x%08x!!!\n",i,ppack.filelen,ppack.startaddr);

                if(ppack.imagetype==UBOOT) {
                    ret = BatchBurn_SPINAND_BOOT(ppack.filelen,0,4,0);
                    if(ret == -1) {
                        printf("Error SPI Nand Device image error !!! \n");
                        return;
                    }
                } else {
                    if(ppack.imagetype!=IMAGE) {
                        BatchBurn_SPINAND(ppack.filelen,ppack.startaddr/(pSN->SPINand_PageSize*pSN->SPINand_PagePerBlock),pspiNandImage->imageType);
                    } else {
                        printf("_ch[0]=%c,_ch[1]=%c,_ch[2]=%c,_ch[3]=%c\n",(char)_ch[0],(char)_ch[1],(char)_ch[2],(char)_ch[3]);
                        BatchBurn_SPINAND(ppack.filelen,ppack.startaddr/(pSN->SPINand_PageSize*pSN->SPINand_PagePerBlock),YAFFS2);
                    }
                }
            }
        }
    }
    break;
    default:
        ;
        break;
    }
}

