OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/parse.c
extern UINT16 usiReadID(void);
extern UINT32 Custom_uBlockPerFlash;
extern UINT32 Custom_uPagePerBlock;
INFO_T info;

void UXmodem_INFO()
{
    UINT8 *ptr=(UINT8 *)&info;
    memset((char *)&info,0x0,sizeof(INFO_T));

    MSG_DEBUG("Receive INFO(%d) flash Image ...\n", sizeof(INFO_T));
    while(1) {
        if(Bulk_Out_Transfer_Size>=sizeof(INFO_T)) {
            usb_recv(ptr,sizeof(INFO_T));
            break;
        }
    }

    if(info.Nand_uIsUserConfig == 1)
        g_uIsUserConfig = 1;
    else
        g_uIsUserConfig = 0;

    Custom_uBlockPerFlash = info.Nand_uBlockPerFlash;
    Custom_uPagePerBlock = info.Nand_uPagePerBlock;
    MSG_DEBUG("g_uIsUserConfig %d -> Nand_uBlockPerFlash=%d, Nand_uPagePerBlock=%d\n", g_uIsUserConfig, Custom_uBlockPerFlash, Custom_uPagePerBlock);
    MSG_DEBUG("Get INFO flash Image ...\n");

#if(1) /* QSPI0 Init */
    if (usiInit() == 1) {
        info.SPI_ID=usiReadID();

        if(info.SPI_ID != 0xffff)
            printf("info.SPI_ID = 0x%x\n", info.SPI_ID);
    }
#endif

#if(1) //SPI NAND
    /* Reset QSPI0 */
    outpw(REG_SYS_APBIPRST1, inpw(REG_SYS_APBIPRST1) | 0x00000010);
    outpw(REG_SYS_APBIPRST1, inpw(REG_SYS_APBIPRST1) & ~(0x00000010));
    printf("\nSPI NAND: ");
    if (spiNANDInit() == 0) {
        info.SPINand_ID = pSN->SPINand_ID;
        if(info.SPINand_ID) { // Detect ID
            printf("%s\n", (info.SPINand_uIsUserConfig==1)?"User Configure":"Auto Detect");
            printf("ID=[0x%x]\n", info.SPINand_ID);
            printf("BlockPerFlash = %d, PagePerBlock = %d\n", pSN->SPINand_BlockPerFlash, pSN->SPINand_PagePerBlock);
            printf("PageSize = %d, SpareArea = %d\n", pSN->SPINand_PageSize, pSN->SPINand_SpareArea);
            printf("QuadReadCmd    = 0x%x\n", pSN->SPINand_QuadReadCmd);
            printf("ReadStatusCmd  = 0x%x\n", pSN->SPINand_ReadStatusCmd);
            printf("WriteStatusCmd = 0x%x\n", pSN->SPINand_WriteStatusCmd);
            printf("StatusValue    = 0x%x\n", pSN->SPINand_StatusValue);
            printf("Dummybyte      = 0x%x\n", pSN->SPINand_dummybyte);
        } // Detect ID
    }
#endif

    // NAND Init
    if(!fmiNandInit()) {
        info.Nand_uBlockPerFlash=pSM->uBlockPerFlash;
        info.Nand_uPagePerBlock=pSM->uPagePerBlock;
        info.Nand_uPageSize=pSM->uPageSize;
        info.Nand_uBadBlockCount=pSM->uBadBlockCount;
        info.Nand_uSpareSize=pSM->uSpareSize;

        printf("BlockPerFlash=%d, PagePerBlock=%d, PageSize=%d\n",info.Nand_uBlockPerFlash, info.Nand_uPagePerBlock, info.Nand_uPageSize);
    }


    /* eMMC/SD Init */
    _sd_ReferenceClock = 12000;    // kHz

    /* select eMMC/SD function pins */
    if (((inpw(REG_SYS_PWRON) & 0x00000300) == 0x300)) {
        printf("\neMMC0/SD0 ");
    } else {
        /* Set GPF for eMMC1/SD1 */
        printf("\neMMC1/SD1 ");
    }

    eMMCBlockSize=fmiInitSDDevice();
    if(eMMCBlockSize>0) {
        info.EMMC_uReserved=GetMMCReserveSpace();
        MSG_DEBUG("eMMC_uReserved =%d ...\n",info.EMMC_uReserved);
        info.EMMC_uBlock=eMMCBlockSize;
    }

    printf("eMMCBlockSize=0x%08x(%d) \n",eMMCBlockSize, eMMCBlockSize);

    usb_send((UINT8 *)&info, sizeof(INFO_T));
    printf("\nFinish get INFO!!\n");
    SendAck((UINT32)0x90); // get INFO done
}

INT ParseFlashType()
{
    switch (_usbd_flash_type) {
    case USBD_FLASH_SDRAM: {
        UXmodem_SDRAM();
        _usbd_flash_type = -1;
    }
    break;
    case USBD_FLASH_MMC: {
        UXmodem_MMC();
        _usbd_flash_type = -1;
    }
    break;
    case USBD_FLASH_NAND: {
        UXmodem_NAND();
        _usbd_flash_type = -1;
    }
    break;
    case USBD_FLASH_SPI: {
        UXmodem_SPI();
        _usbd_flash_type = -1;
    }
    break;
    case USBD_FLASH_SPINAND: {
        UXmodem_SPINAND();
        _usbd_flash_type = -1;
    }
    break;
    case USBD_INFO: {
        UXmodem_INFO();
        _usbd_flash_type = -1;
    }

    case -1 : { // load xusb.bin again
        if(Bulk_Out_Transfer_Size>0) {
            unsigned char *ptr;
            unsigned int *_ack=NULL,len;
            ptr =((unsigned char*)(((unsigned int)DOWNLOAD_BASE)|NON_CACHE));
            len=Bulk_Out_Transfer_Size;
            usb_recv(ptr,len);
            do {
                len=Bulk_Out_Transfer_Size;
                if(len>0) {
                    len=Bulk_Out_Transfer_Size;
                    usb_recv(ptr,len);
                    *_ack=4097;
                    usb_send((unsigned char*)_ack,4);//send ack to PC
                    break;
                }
            } while(1);
        }
    }
    break;

    default:
        break;
    }

    return 0;
}
